app/Models/Model_Home.php

SELECT *
FROM `buku`
ORDER BY `id_buku` ASC
---
    public function AllData()
    {
        return $this->orderBy('id_buku', "asc")->findAll();

SELECT *
FROM `buku`
JOIN `penerbit` ON `penerbit`.`nama_penerbit`=`buku`.`penerbit`
WHERE `nama_buku` = ('bisnis online')
---
    public function cari($detail)
    {
        return $this->db->table('buku')->join(
            'penerbit',
            'penerbit.nama_penerbit=buku.penerbit'
        )->where('nama_buku', $detail)->get()->getResultArray();