app/Models/Model_Admin.php

SELECT *
FROM `penerbit`
ORDER BY `id_penerbit` ASC
---
    public function AllData()
    {
        return $this->orderBy('id_penerbit', "asc")->findAll();

INSERT INTO `buku` (`id_buku`, `kategori`, `nama_buku`, `harga`, `stok`, `penerbit`) VALUES ('h1003', 'jadul', 'aku yang dulu', '50000', '5', 'aku')
---
    public function Tambah($data)
    {
        $this->db->table('buku')->insert($data);

UPDATE `buku` SET `id_buku` = 'h1002', `kategori` = 'jadulksndz vksd', `nama_buku` = 'aku yang dulukjndavkjndsk', `harga` = '50000', `stok` = '10', `penerbit` = 'yyyy'
WHERE `id_buku` = 'h1002'
---
    public function ubahdata($data)
    {
        $this->db->table('buku')->where('id_buku', $data['id_buku'])->update($data);

DELETE FROM `buku`
WHERE `id_buku` = 'h1002'
AND `id_buku` = 'h1002'
---
    public function hapusdata($data)
    {
        $this->db->table('buku')->where('id_buku', $data['id_buku'])->delete($data);