app/Models/Model_Pengadaan.php

    public function AllData($stok = 10)
    {
        return $this->db->table('buku')->where('stok <', '10')->orderBy('stok', "asc")->get()->getResultArray();
---
SELECT *
FROM `buku`
WHERE `stok` < '10'
ORDER BY `stok` ASC